cleanup -- RM plantuml
