--- a/src/pages/archi/tp-uml.md
+++ b/src/pages/archi/tp-uml.md
@@ -17,20 +17,20 @@ Le projet a été spécifié grâce à un ensemble de diagrammes de classes et d
 
 ## Diagramme de cas d'utilisation
 
-``` plantuml
-@startuml
+```mermaid
+---
+title: Diagramme de cas d'utilisation
+---
+flowchart LR
+    Patron["🧑 Patron"]
+    Librarian["🧑 Librarian"]
 
-caption
-= Diagramme de cas d'utilisation
-endcaption
+    Patron --> Login
+    Patron --> Search
+    Librarian --> Login
+    Librarian --> Search
+    Librarian --> Manage_subscriptions
 
-"Search in the application" as (Search)
-:Patron: --> (Login)
-:Patron: --> (Search)
-:Librarian: --> (Login)
-:Librarian: --> (Search)
-:Librarian: --> (Manage subscriptions)
-@enduml
 ```
 
 L'application décrit trois cas d'utilisation :
@@ -45,35 +45,35 @@ Les deux interfaces correspondent à deux vues différentes dans l'application W
 
 ## Diagrammes de composants
 
-``` plantuml
-@startuml
+```mermaid
+---
+title: Diagramme de composants
+---
 
-caption
-= Diagramme de composants
-endcaption
+graph TD
 
-database "Persistence"
+subgraph Persistence
+  PersistenceDB[Database: Persistence]
+end
 
-package "Backend" {
-  frame "Web API" {
-    [:Authentication]
-    [:Library]
-  }
-}
+subgraph Backend
+  subgraph Web_API
+    Authentication[Component: Authentication]
+    Library[Component: Library]
+  end
+end
 
-package "Frontend" {
-  [:Login]
-  [:Search]
-  [:Manage]
-}
+subgraph Frontend
+  Login[Component: Login]
+  Search[Component: Search]
+  Manage[Component: Manage]
+end
 
-[:Login] --> [:Authentication] : Web Login
-[:Search] --> [:Library] : Search inventory
-[:Manage] --> [:Library] : Add/Update/Delete inventory
-[:Library] --> [Persistence] : Load/Persist
-[:Authentication] --> [Persistence] : Load/Persist
-
-@enduml
+Login -->|Web Login| Authentication
+Search -->|Search inventory| Library
+Manage -->|Add/Update/Delete inventory| Library
+Library -->|Load/Persist| PersistenceDB
+Authentication -->|Load/Persist| PersistenceDB
 ```
 
 L'application est composée de trois composants principaux :
